import pandas as pd
# from typing import Any

# 파일명
file_name = 'xlsx/visitor_data_2023.xlsx'

# Daraframe형식으로 엑셀 파일 읽기
df = pd.read_excel(file_name, sheet_name='Sheet1')


###################### 7/7 수집 데이터 목록
# 문9-2. 방문지역 : 코로나 이전 (18,19) / 이후 (22,23)

###################### 수집 해야 할 데이터 목록
####### 해외
# 한국 방문횟수 => 재방문률 (방문횟수2회이상인 경우 재방문으로)
# 한국 방문횟수 : RVIT (1~4) , 한국 방문횟수(재방문) : XRVIT (재방문인 경우 5)

# 한국 재방문의사
# 문13. 재방문 의사 : Q13 (1:매우 불만족, 2:불만족, 3:보통, 4:만족, 5:매우 만족)

# 한국 추천의향
# 문14. 타인 추천 의향 : Q14 (1:전혀 그렇지 않다, 2:별로 그렇지 않다, 3:보통, 4:대체로 그렇다, 5:매우 그렇다)

# 가장 좋았던 곳(별첨 참고)
# 문9-1. 가장 좋았던곳 : Q9_1_1 ~ Q9_1_5 ()

# 방문 지역
# 문9-2. 방문지역 : Q9_2a01 ~ Q9_2a17 (1:서울, 2:경기, 3:인천, 4:강원, 5:대전, 6:충북, 7:충남, 8:세종, 9:경북, 10:경남, 11:대구, 12:울산, 13:부산, 14:광주, 15:전북, 16:전남, 17:제주)

# 응답자 정보
# 월별 : D_MON (1.00~12.00 : 1월~12월)
# 분기별 : D_BUN (1.00~4.00 : 1~4분기)
# 국가별 : D_NAT (1.00:중국, 2.00:일본, 3.00:대만, 4.00:미국, 5.00:홍콩, 6.00:태국,7.00:베트남,8.00:말레이시아,9.00:필리핀,10.00:싱가포르,11.00:러시아,12.00:중동,13.00:인도네시아,14.00:캐나다,15.00:호주,16.00:영국,17.00:몽골,18.00:독일,19.00:프랑스,20.00:인도,97.00:기타)
# 성별 : D_SEX (1.00:남성, 2.00:여성)
# 연령별 : D_AGE (1.00:15~19세, 2.00:20대, 3.00:30대, 4.00:40대, 5.00:50대, 6.00:60대 이상)
# 방한목적별 : D_MOK (1.00:여가/위락/휴식 2.00:친구/친지 방문, 3.00:사업/전문 활동, 4.00:교육, 5.00:기타)
# 방한횟수별 : D_NUM (1.00~4.00:1회~4회이상)
# 여행형태별 : D_GUB (1.00:개별여행, 2.00:AIR-TEL 분석변수, 3.00:단체여행)
# 가중치 : weight

###### 국내 ( 국내 여행 조사 자료 에 보면 22년에 도입한 도시, 23년에 도입한 도시가 각각 있음, => 22,23,24(1,2분기))
# - 관광 주민증 전/후 방문 데이터

# 국내/해외 구분 및 년도 정보 추가
df['year'] = 2023
df['type'] = '해외'

# 컬럼 소문자 처리
df.columns = df.columns.str.lower()

# 한국 방문 횟수
df_rvit = df[['year', 'rvit']]
df_rvit.to_json('json/visit_rvit.json')

# 한국 재방문 여부
df_xrvit = df[['year', 'xrvit']]
df_xrvit.to_json('json/visit_xrvit.json')

# 한국 재방문의사
df_q13 = df[['year', 'q13']]
df_q13.to_json('json/visit_q13.json')

# 한국 추천의향
df_q14 = df[['year', 'q14']]
df_q14.to_json('json/visit_q14.json')
# 문14. 타인 추천 의향 : Q14 (1:전혀 그렇지 않다, 2:별로 그렇지 않다, 3:보통, 4:대체로 그렇다, 5:매우 그렇다)

# 가장 좋았던 곳(별첨 참고)
df_q9_1_1 = df[['year', 'q9_1_1']]
df_q14.to_json('json/visit_q14.json')
# 문9-1. 가장 좋았던곳 : Q9_1_1 ~ Q9_1_5 ()

# 방문 지역
# 문9-2. 방문지역 : Q9_2a01 ~ Q9_2a17 (1:서울, 2:경기, 3:인천, 4:강원, 5:대전, 6:충북, 7:충남, 8:세종, 9:경북, 10:경남, 11:대구, 12:울산, 13:부산, 14:광주, 15:전북, 16:전남, 17:제주)

# 응답자 정보
# 월별 : D_MON (1.00~12.00 : 1월~12월)
# 분기별 : D_BUN (1.00~4.00 : 1~4분기)
# 국가별 : D_NAT (1.00:중국, 2.00:일본, 3.00:대만, 4.00:미국, 5.00:홍콩, 6.00:태국,7.00:베트남,8.00:말레이시아,9.00:필리핀,10.00:싱가포르,11.00:러시아,12.00:중동,13.00:인도네시아,14.00:캐나다,15.00:호주,16.00:영국,17.00:몽골,18.00:독일,19.00:프랑스,20.00:인도,97.00:기타)
# 성별 : D_SEX (1.00:남성, 2.00:여성)
# 연령별 : D_AGE (1.00:15~19세, 2.00:20대, 3.00:30대, 4.00:40대, 5.00:50대, 6.00:60대 이상)
# 방한목적별 : D_MOK (1.00:여가/위락/휴식 2.00:친구/친지 방문, 3.00:사업/전문 활동, 4.00:교육, 5.00:기타)
# 방한횟수별 : D_NUM (1.00~4.00:1회~4회이상)
# 여행형태별 : D_GUB (1.00:개별여행, 2.00:AIR-TEL 분석변수, 3.00:단체여행)
# 가중치 : weight



# # JSON 파일 읽기
# df2 = pd.read_json('json/visit_rvit.json')
# print(df2)

# # JSON 파일 저장
# df['RVIT'].to_json('json/visitor_2023_rvit.json')

# # JSON 파일 읽기
# df2 = pd.read_json('json/visitor_2023_rvit.json')
# print(df2)

# 2023 년
# {
#     'pnid':{'name':'아이디','item':{}}
#     ,'MVIT':{'name':'한국 방문횟수(평균)','item':{1.0:'1회',2.0:'2회',}}
#     ,'RVIT':{'name':'한국 방문횟수(재방문)','item':{}}
#     ,'XRVIT':{'name':'명칭','item':{}}
#     ,'TYP':{'name':'명칭','item':{}}
#     ,'Q1':{'name':'명칭','item':{}}
#     ,'Q1_1a1':{'name':'명칭','item':{}}
#     ,'Q1_1a2':{'name':'명칭','item':{}}
#     ,'Q1_1a3':{'name':'명칭','item':{}}
#     ,'Q2a1':{'name':'명칭','item':{}}
#     ,'Q2a2':{'name':'명칭','item':{}}
#     ,'Q2a3':{'name':'명칭','item':{}}
#     ,'Q2a_dk':{'name':'명칭','item':{}}
#     ,'Q2_1a1':{'name':'명칭','item':{}}
#     ,'Q2_1a2':{'name':'명칭','item':{}}
#     ,'Q2_1a3':{'name':'명칭','item':{}}
#     ,'Q3_1a1':{'name':'명칭','item':{}}
#     ,'Q3_1a2':{'name':'명칭','item':{}}
#     ,'Q3_1a3':{'name':'명칭','item':{}}
#     ,'Q3_2a1':{'name':'명칭','item':{}}
#     ,'Q3_2a2':{'name':'명칭','item':{}}
#     ,'Q3_2a3':{'name':'명칭','item':{}}
#     ,'Q4a1':{'name':'명칭','item':{}}
#     ,'Q4a2':{'name':'명칭','item':{}}
#     ,'Q4a3':{'name':'명칭','item':{}}
#     ,'Q4a_dk':{'name':'명칭','item':{}}
#     ,'Q4_1a1':{'name':'명칭','item':{}}
#     ,'Q4_1a2':{'name':'명칭','item':{}}
#     ,'Q4_1a3':{'name':'명칭','item':{}}
#     ,'Q4_2a1':{'name':'명칭','item':{}}
#     ,'Q4_2a2':{'name':'명칭','item':{}}
#     ,'Q4_2a3':{'name':'명칭','item':{}}
#     ,'Q4_2a_dk':{'name':'명칭','item':{}}
#     ,'Q5':{'name':'명칭','item':{}}
#     ,'Q5_1a01':{'name':'명칭','item':{}}
#     ,'Q5_1a02':{'name':'명칭','item':{}}
#     ,'Q5_1a03':{'name':'명칭','item':{}}
#     ,'Q5_1a04':{'name':'명칭','item':{}}
#     ,'Q5_1a05':{'name':'명칭','item':{}}
#     ,'Q5_1a06':{'name':'명칭','item':{}}
#     ,'Q5_1a07':{'name':'명칭','item':{}}
#     ,'Q5_1a08':{'name':'명칭','item':{}}
#     ,'Q5_1a09':{'name':'명칭','item':{}}
#     ,'Q5_1a10':{'name':'명칭','item':{}}
#     ,'Q5_1a99':{'name':'명칭','item':{}}
#     ,'Q7A':{'name':'명칭','item':{}}
#     ,'Q7a_dk':{'name':'명칭','item':{}}
#     ,'Q7a2':{'name':'명칭','item':{}}
#     ,'Q7a3':{'name':'명칭','item':{}}
#     ,'Q7a4':{'name':'명칭','item':{}}
#     ,'Q7a5':{'name':'명칭','item':{}}
#     ,'Q7a6':{'name':'명칭','item':{}}
#     ,'Q7a7':{'name':'명칭','item':{}}
#     ,'Q7a8':{'name':'명칭','item':{}}
#     ,'MQ7_1':{'name':'명칭','item':{}}
#     ,'MQ7_1제외':{'name':'명칭','item':{}}
#     ,'MQ7_2':{'name':'명칭','item':{}}
#     ,'MQ7_1$15제외':{'name':'명칭','item':{}}
#     ,'MQ7_1제외$15제외':{'name':'명칭','item':{}}
#     ,'RQ7_1':{'name':'명칭','item':{}}
#     ,'RQ7_1제외':{'name':'명칭','item':{}}
#     ,'RQ7_2':{'name':'명칭','item':{}}
#     ,'RQ7_1$15제외':{'name':'명칭','item':{}}
#     ,'RQ7_1제외$15제외':{'name':'명칭','item':{}}
#     ,'Q8a01':{'name':'명칭','item':{}}
#     ,'Q8a02':{'name':'명칭','item':{}}
#     ,'Q8a03':{'name':'명칭','item':{}}
#     ,'Q8a04':{'name':'명칭','item':{}}
#     ,'Q8a05':{'name':'명칭','item':{}}
#     ,'Q8a06':{'name':'명칭','item':{}}
#     ,'Q8a07':{'name':'명칭','item':{}}
#     ,'Q8a08':{'name':'명칭','item':{}}
#     ,'Q8a09':{'name':'명칭','item':{}}
#     ,'Q8a10':{'name':'명칭','item':{}}
#     ,'Q8a11':{'name':'명칭','item':{}}
#     ,'Q8a12':{'name':'명칭','item':{}}
#     ,'Q8a13':{'name':'명칭','item':{}}
#     ,'Q8a14':{'name':'명칭','item':{}}
#     ,'Q8a15':{'name':'명칭','item':{}}
#     ,'Q8a16':{'name':'명칭','item':{}}
#     ,'Q8a17':{'name':'명칭','item':{}}
#     ,'Q8a18':{'name':'명칭','item':{}}
#     ,'Q8a19':{'name':'명칭','item':{}}
#     ,'Q8_1a1':{'name':'명칭','item':{}}
#     ,'Q8_1a2':{'name':'명칭','item':{}}
#     ,'Q8_1a3':{'name':'명칭','item':{}}
#     ,'Q9_1_1':{'name':'명칭','item':{}}
#     ,'Q9_1_2':{'name':'명칭','item':{}}
#     ,'Q9_1_3':{'name':'명칭','item':{}}
#     ,'Q9_1_4':{'name':'명칭','item':{}}
#     ,'Q9_1_5':{'name':'명칭','item':{}}
#     ,'Q9_2a01':{'name':'명칭','item':{}}
#     ,'Q9_2a02':{'name':'명칭','item':{}}
#     ,'Q9_2a03':{'name':'명칭','item':{}}
#     ,'Q9_2a04':{'name':'명칭','item':{}}
#     ,'Q9_2a05':{'name':'명칭','item':{}}
#     ,'Q9_2a06':{'name':'명칭','item':{}}
#     ,'Q9_2a07':{'name':'명칭','item':{}}
#     ,'Q9_2a08':{'name':'명칭','item':{}}
#     ,'Q9_2a09':{'name':'명칭','item':{}}
#     ,'Q9_2a10':{'name':'명칭','item':{}}
#     ,'Q9_2a11':{'name':'명칭','item':{}}
#     ,'Q9_2a12':{'name':'명칭','item':{}}
#     ,'Q9_2a13':{'name':'명칭','item':{}}
#     ,'Q9_2a14':{'name':'명칭','item':{}}
#     ,'Q9_2a15':{'name':'명칭','item':{}}
#     ,'Q9_2a16':{'name':'명칭','item':{}}
#     ,'Q9_2a17':{'name':'명칭','item':{}}
#     ,'KWON1':{'name':'명칭','item':{}}
#     ,'KWON2':{'name':'명칭','item':{}}
#     ,'KWON3':{'name':'명칭','item':{}}
#     ,'KWON4':{'name':'명칭','item':{}}
#     ,'KWON5':{'name':'명칭','item':{}}
#     ,'KWON6':{'name':'명칭','item':{}}
#     ,'KWON7':{'name':'명칭','item':{}}
#     ,'KWON8':{'name':'명칭','item':{}}
#     ,'KWONA1':{'name':'명칭','item':{}}
#     ,'KWONA2':{'name':'명칭','item':{}}
#     ,'KWONA3':{'name':'명칭','item':{}}
#     ,'KWONB1':{'name':'명칭','item':{}}
#     ,'KWONB2':{'name':'명칭','item':{}}
#     ,'M박HAP':{'name':'명칭','item':{}}
#     ,'M일HAP':{'name':'명칭','item':{}}
#     ,'M일HAP_61':{'name':'명칭','item':{}}
#     ,'R1일HAP':{'name':'명칭','item':{}}
#     ,'서울박TOT':{'name':'명칭','item':{}}
#     ,'경기박TOT':{'name':'명칭','item':{}}
#     ,'인천박TOT':{'name':'명칭','item':{}}
#     ,'강원박TOT':{'name':'명칭','item':{}}
#     ,'대전박TOT':{'name':'명칭','item':{}}
#     ,'충북박TOT':{'name':'명칭','item':{}}
#     ,'충남박TOT':{'name':'명칭','item':{}}
#     ,'세종박TOT':{'name':'명칭','item':{}}
#     ,'경북박TOT':{'name':'명칭','item':{}}
#     ,'경남박TOT':{'name':'명칭','item':{}}
#     ,'대구박TOT':{'name':'명칭','item':{}}
#     ,'울산박TOT':{'name':'명칭','item':{}}
#     ,'부산박TOT':{'name':'명칭','item':{}}
#     ,'광주박TOT':{'name':'명칭','item':{}}
#     ,'전북박TOT':{'name':'명칭','item':{}}
#     ,'전남박TOT':{'name':'명칭','item':{}}
#     ,'제주박TOT':{'name':'명칭','item':{}}
#     ,'서울일TOT':{'name':'명칭','item':{}}
#     ,'경기일TOT':{'name':'명칭','item':{}}
#     ,'인천일TOT':{'name':'명칭','item':{}}
#     ,'강원일TOT':{'name':'명칭','item':{}}
#     ,'대전일TOT':{'name':'명칭','item':{}}
#     ,'충북일TOT':{'name':'명칭','item':{}}
#     ,'충남일TOT':{'name':'명칭','item':{}}
#     ,'세종일TOT':{'name':'명칭','item':{}}
#     ,'경북일TOT':{'name':'명칭','item':{}}
#     ,'경남일TOT':{'name':'명칭','item':{}}
#     ,'대구일TOT':{'name':'명칭','item':{}}
#     ,'울산일TOT':{'name':'명칭','item':{}}
#     ,'부산일TOT':{'name':'명칭','item':{}}
#     ,'광주일TOT':{'name':'명칭','item':{}}
#     ,'전북일TOT':{'name':'명칭','item':{}}
#     ,'전남일TOT':{'name':'명칭','item':{}}
#     ,'제주일TOT':{'name':'명칭','item':{}}
#     ,'서울박60':{'name':'명칭','item':{}}
#     ,'경기박60':{'name':'명칭','item':{}}
#     ,'인천박60':{'name':'명칭','item':{}}
#     ,'강원박60':{'name':'명칭','item':{}}
#     ,'대전박60':{'name':'명칭','item':{}}
#     ,'충북박60':{'name':'명칭','item':{}}
#     ,'충남박60':{'name':'명칭','item':{}}
#     ,'세종박60':{'name':'명칭','item':{}}
#     ,'경북박60':{'name':'명칭','item':{}}
#     ,'경남박60':{'name':'명칭','item':{}}
#     ,'대구박60':{'name':'명칭','item':{}}
#     ,'울산박60':{'name':'명칭','item':{}}
#     ,'부산박60':{'name':'명칭','item':{}}
#     ,'광주박60':{'name':'명칭','item':{}}
#     ,'전북박60':{'name':'명칭','item':{}}
#     ,'전남박60':{'name':'명칭','item':{}}
#     ,'제주박60':{'name':'명칭','item':{}}
#     ,'서울일61':{'name':'명칭','item':{}}
#     ,'경기일61':{'name':'명칭','item':{}}
#     ,'인천일61':{'name':'명칭','item':{}}
#     ,'강원일61':{'name':'명칭','item':{}}
#     ,'대전일61':{'name':'명칭','item':{}}
#     ,'충북일61':{'name':'명칭','item':{}}
#     ,'충남일61':{'name':'명칭','item':{}}
#     ,'세종일61':{'name':'명칭','item':{}}
#     ,'경북일61':{'name':'명칭','item':{}}
#     ,'경남일61':{'name':'명칭','item':{}}
#     ,'대구일61':{'name':'명칭','item':{}}
#     ,'울산일61':{'name':'명칭','item':{}}
#     ,'부산일61':{'name':'명칭','item':{}}
#     ,'광주일61':{'name':'명칭','item':{}}
#     ,'전북일61':{'name':'명칭','item':{}}
#     ,'전남일61':{'name':'명칭','item':{}}
#     ,'제주일61':{'name':'명칭','item':{}}
#     ,'Q9_5A1':{'name':'명칭','item':{}}
#     ,'Q9_5A2':{'name':'명칭','item':{}}
#     ,'Q9_5A3':{'name':'명칭','item':{}}
#     ,'Q9_5A4':{'name':'명칭','item':{}}
#     ,'Q9_5A5':{'name':'명칭','item':{}}
#     ,'Q9_5A6':{'name':'명칭','item':{}}
#     ,'Q9_5A7':{'name':'명칭','item':{}}
#     ,'Q9_5A8':{'name':'명칭','item':{}}
#     ,'Q9_5A9':{'name':'명칭','item':{}}
#     ,'호텔숙박':{'name':'명칭','item':{}}
#     ,'모텔숙박':{'name':'명칭','item':{}}
#     ,'콘도숙박':{'name':'명칭','item':{}}
#     ,'게스숙박':{'name':'명칭','item':{}}
#     ,'민박숙박':{'name':'명칭','item':{}}
#     ,'학교숙박':{'name':'명칭','item':{}}
#     ,'친척숙박':{'name':'명칭','item':{}}
#     ,'기타숙박':{'name':'명칭','item':{}}
#     ,'호텔숙박60':{'name':'명칭','item':{}}
#     ,'모텔숙박60':{'name':'명칭','item':{}}
#     ,'콘도숙박60':{'name':'명칭','item':{}}
#     ,'게스숙박60':{'name':'명칭','item':{}}
#     ,'민박숙박60':{'name':'명칭','item':{}}
#     ,'학교숙박60':{'name':'명칭','item':{}}
#     ,'친척숙박60':{'name':'명칭','item':{}}
#     ,'기타숙박60':{'name':'명칭','item':{}}
#     ,'총액1인MIS':{'name':'명칭','item':{}}
#     ,'총액1인TOT2':{'name':'명칭','item':{}}
#     ,'총액1인MIS_개별국제교통비제외':{'name':'명칭','item':{}}
#     ,'총액1인TOT항공제외2':{'name':'명칭','item':{}}
#     ,'C총액1인MIS':{'name':'명칭','item':{}}
#     ,'C총액1인TOT2':{'name':'명칭','item':{}}
#     ,'C총액1인MIS_개별국제교통비제외':{'name':'명칭','item':{}}
#     ,'C총액1인TOT항공제외2':{'name':'명칭','item':{}}
#     ,'MDAY전체':{'name':'명칭','item':{}}
#     ,'MDAY전체TOT_RAW2':{'name':'명칭','item':{}}
#     ,'MDAY전체TOT_RAW61':{'name':'명칭','item':{}}
#     ,'MDAY전체_개별국제교통비제외':{'name':'명칭','item':{}}
#     ,'MDAY전체TOT_RAW61항공제외2':{'name':'명칭','item':{}}
#     ,'RDAY전체':{'name':'명칭','item':{}}
#     ,'RDAY전체TOT_RAW2':{'name':'명칭','item':{}}
#     ,'RDAY전체TOT_RAW61':{'name':'명칭','item':{}}
#     ,'RDAY전체_개별국제교통비제외':{'name':'명칭','item':{}}
#     ,'RDAY전체TOT_RAW61항공제외2':{'name':'명칭','item':{}}
#     ,'MDAY개별대체':{'name':'명칭','item':{}}
#     ,'MDAY에어대체':{'name':'명칭','item':{}}
#     ,'MDAY단체대체':{'name':'명칭','item':{}}
#     ,'MDAY개별61대체':{'name':'명칭','item':{}}
#     ,'MDAY에어61대체':{'name':'명칭','item':{}}
#     ,'MDAY단체61대체':{'name':'명칭','item':{}}
#     ,'MDAY개별61항공제외대체':{'name':'명칭','item':{}}
#     ,'MDAY에어61항공제외대체':{'name':'명칭','item':{}}
#     ,'MDAY단체61항공제외대체':{'name':'명칭','item':{}}
#     ,'RDAY개별대체':{'name':'명칭','item':{}}
#     ,'RDAY에어대체':{'name':'명칭','item':{}}
#     ,'RDAY단체대체':{'name':'명칭','item':{}}
#     ,'RDAY개별61대체':{'name':'명칭','item':{}}
#     ,'RDAY에어61대체':{'name':'명칭','item':{}}
#     ,'RDAY단체61대체':{'name':'명칭','item':{}}
#     ,'RDAY개별61항공제외대체':{'name':'명칭','item':{}}
#     ,'RDAY에어61항공제외대체':{'name':'명칭','item':{}}
#     ,'RDAY단체61항공제외대체':{'name':'명칭','item':{}}
#     ,'여행사1인대체':{'name':'명칭','item':{}}
#     ,'가이드1인대체':{'name':'명칭','item':{}}
#     ,'숙박비1인대체':{'name':'명칭','item':{}}
#     ,'음식점1인대체':{'name':'명칭','item':{}}
#     ,'식음료1인대체':{'name':'명칭','item':{}}
#     ,'국제한국1인대체':{'name':'명칭','item':{}}
#     ,'국제국외1인대체':{'name':'명칭','item':{}}
#     ,'국제수상1인대체':{'name':'명칭','item':{}}
#     ,'한국한국1인대체':{'name':'명칭','item':{}}
#     ,'한국국외1인대체':{'name':'명칭','item':{}}
#     ,'한국수상1인대체':{'name':'명칭','item':{}}
#     ,'한국철도1인대체':{'name':'명칭','item':{}}
#     ,'한국도로1인대체':{'name':'명칭','item':{}}
#     ,'대여서1인대체':{'name':'명칭','item':{}}
#     ,'유류비1인대체':{'name':'명칭','item':{}}
#     ,'문화서1인대체':{'name':'명칭','item':{}}
#     ,'오락및1인대체':{'name':'명칭','item':{}}
#     ,'쇼핑비1인대체':{'name':'명칭','item':{}}
#     ,'데이터1인대체':{'name':'명칭','item':{}}
#     ,'치료및1인대체':{'name':'명칭','item':{}}
#     ,'미용서1인대체':{'name':'명칭','item':{}}
#     ,'기타비1인대체':{'name':'명칭','item':{}}
#     ,'C여행사1인대체':{'name':'명칭','item':{}}
#     ,'C가이드1인대체':{'name':'명칭','item':{}}
#     ,'C숙박비1인대체':{'name':'명칭','item':{}}
#     ,'C음식점1인대체':{'name':'명칭','item':{}}
#     ,'C식음료1인대체':{'name':'명칭','item':{}}
#     ,'C국제한국1인대체':{'name':'명칭','item':{}}
#     ,'C국제국외1인대체':{'name':'명칭','item':{}}
#     ,'C국제수상1인대체':{'name':'명칭','item':{}}
#     ,'C한국한국1인대체':{'name':'명칭','item':{}}
#     ,'C한국국외1인대체':{'name':'명칭','item':{}}
#     ,'C한국수상1인대체':{'name':'명칭','item':{}}
#     ,'C한국철도1인대체':{'name':'명칭','item':{}}
#     ,'C한국도로1인대체':{'name':'명칭','item':{}}
#     ,'C대여서1인대체':{'name':'명칭','item':{}}
#     ,'C유류비1인대체':{'name':'명칭','item':{}}
#     ,'C문화서1인대체':{'name':'명칭','item':{}}
#     ,'C오락및1인대체':{'name':'명칭','item':{}}
#     ,'C쇼핑비1인대체':{'name':'명칭','item':{}}
#     ,'C데이터1인대체':{'name':'명칭','item':{}}
#     ,'C치료및1인대체':{'name':'명칭','item':{}}
#     ,'C미용서1인대체':{'name':'명칭','item':{}}
#     ,'C기타비1인대체':{'name':'명칭','item':{}}
#     ,'Q10_2a01':{'name':'명칭','item':{}}
#     ,'Q10_2a02':{'name':'명칭','item':{}}
#     ,'Q10_2a03':{'name':'명칭','item':{}}
#     ,'Q10_2a04':{'name':'명칭','item':{}}
#     ,'Q10_2a05':{'name':'명칭','item':{}}
#     ,'Q10_2a06':{'name':'명칭','item':{}}
#     ,'Q10_2a07':{'name':'명칭','item':{}}
#     ,'Q10_2a08':{'name':'명칭','item':{}}
#     ,'Q10_2a09':{'name':'명칭','item':{}}
#     ,'Q10_2a10':{'name':'명칭','item':{}}
#     ,'Q10_2a11':{'name':'명칭','item':{}}
#     ,'Q10_2a12':{'name':'명칭','item':{}}
#     ,'Q10_2a13':{'name':'명칭','item':{}}
#     ,'MQ10_2b01':{'name':'명칭','item':{}}
#     ,'MQ10_2b02':{'name':'명칭','item':{}}
#     ,'MQ10_2b03':{'name':'명칭','item':{}}
#     ,'MQ10_2b04':{'name':'명칭','item':{}}
#     ,'MQ10_2b05':{'name':'명칭','item':{}}
#     ,'MQ10_2b06':{'name':'명칭','item':{}}
#     ,'MQ10_2b07':{'name':'명칭','item':{}}
#     ,'MQ10_2b08':{'name':'명칭','item':{}}
#     ,'MQ10_2b09':{'name':'명칭','item':{}}
#     ,'MQ10_2b10':{'name':'명칭','item':{}}
#     ,'MQ10_2b11':{'name':'명칭','item':{}}
#     ,'MQ10_2b12':{'name':'명칭','item':{}}
#     ,'MQ10_2b13':{'name':'명칭','item':{}}
#     ,'Q10_3a1':{'name':'명칭','item':{}}
#     ,'Q10_3a2':{'name':'명칭','item':{}}
#     ,'Q10_3a3':{'name':'명칭','item':{}}
#     ,'Q11':{'name':'명칭','item':{}}
#     ,'Q12a01':{'name':'명칭','item':{}}
#     ,'Q12a02':{'name':'명칭','item':{}}
#     ,'Q12a03':{'name':'명칭','item':{}}
#     ,'Q12a04':{'name':'명칭','item':{}}
#     ,'Q12a05':{'name':'명칭','item':{}}
#     ,'Q12a06':{'name':'명칭','item':{}}
#     ,'Q12a07':{'name':'명칭','item':{}}
#     ,'Q12a08':{'name':'명칭','item':{}}
#     ,'Q12a09':{'name':'명칭','item':{}}
#     ,'Q12a10':{'name':'명칭','item':{}}
#     ,'Q12a11':{'name':'명칭','item':{}}
#     ,'Q12a12':{'name':'명칭','item':{}}
#     ,'Q12a13':{'name':'명칭','item':{}}
#     ,'Q12a14':{'name':'명칭','item':{}}
#     ,'Q12a15':{'name':'명칭','item':{}}
#     ,'Q12a16':{'name':'명칭','item':{}}
#     ,'Q12a17':{'name':'명칭','item':{}}
#     ,'Q12a18':{'name':'명칭','item':{}}
#     ,'Q12a19':{'name':'명칭','item':{}}
#     ,'Q12a20':{'name':'명칭','item':{}}
#     ,'Q12a21':{'name':'명칭','item':{}}
#     ,'Q12a22':{'name':'명칭','item':{}}
#     ,'Q12a23':{'name':'명칭','item':{}}
#     ,'Q12a24':{'name':'명칭','item':{}}
#     ,'Q12a25':{'name':'명칭','item':{}}
#     ,'Q12a26':{'name':'명칭','item':{}}
#     ,'Q13':{'name':'명칭','item':{}}
#     ,'Q14':{'name':'명칭','item':{}}
#     ,'D_MON':{'name':'명칭','item':{}}
#     ,'D_BUN':{'name':'명칭','item':{}}
#     ,'D_NAT':{'name':'명칭','item':{}}
#     ,'D_SEX':{'name':'명칭','item':{}}
#     ,'D_AGE':{'name':'명칭','item':{}}
#     ,'D_MOK':{'name':'명칭','item':{}}
#     ,'D_NUM':{'name':'명칭','item':{}}
#     ,'D_GUB':{'name':'명칭','item':{}}
#     ,'weight':{'name':'명칭','item':{}}
# }



class VisitorSurvey:
    def __init__(self):
        self.pnid = None